src/resume.org
#+TITLE: Pankaj Jangid
#+OPTIONS: toc:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: author:nil
#+OPTIONS: date:nil
#+OPTIONS: num:nil
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}

#+SUBTITLE: 46 Sadar Apartments, Mayur Vihar Phase 1 Extension, New Delhi 110091, India @@latex:\\@@ +91-9811942047 . pankaj.jangid@codeisgreat.com @@latex:\\@@ https://www.linkedin.com/in/pankaj-jangid/ . https://github.com/jangid/
-----
* title :noexport:
  [Note: [[Skills][Skip Cover]] if you want to go directly to my skills.]

  Organizations can do much better if they invest in the right technology at the right time. Otherwise they just fade away. One of my permanent objectives is to continuously explore emerging technologies and keep myself hands on with it. I keep the systems progressively aligned with the latest technology trends. And I am currently exploring opportunities where I can make a meaningful impact.

  I'm an extremely effective software engineering leader, focusing particularly on open source technologies and agile practices. With 19+ years of hands-on industry experience, I understand how to select, build and refine software and teams to add business value and reduce costs.

  People hire me to lead their software teams, solve hard technical problems, advise them on technology choices, and coach their developers using the latest industry practices and tools. Clients and employers around the world have valued my versatility and balance of deep technical, business and people skills.

  I've worked as a senior consultant at elite companies such as Cadence Design Systems, NEC, and consulted independently with huge industry-leading businesses both in the India, US, Japan.  But start-ups are my real passion: I've started some, led development at several others, and consulted with yet more.

  Areas of particular technical expertise and interest currently include design of manufacturing process automation, robotics, artificial intelligence, large data systems, programming languages, operating systems, and I have a high level knowledge across a very wide range of languages and open source technologies. With my fingers in many pies.

  Below are highlights of my career

  - Designed first of its kind assembly line interlocking system based on Raspberry Pi for an auto components manufacturing company in Gurgaon. They were struggling to get this done since past many years and have tried to work with many other consultants. This is first such system based on Raspberry Pi. Practically infinitely scalable, extensible. Earlier systems are mostly based on PLCs and they are difficult to integrate with databases and other record keeping systems. The data gathered can now be easily used for machine-learning and artificial intelligent systems.
  - I am currently managing all the product teams at Optimizory, each of which has significant engineering requirements. The products are served from Amazon's AWS Cloud as well as home-grown data centres at large corporations. These products support large number of concurrent users. Products can be seen at https://optimizory.com/products/.
  - US Department of Defense, NASA, Lockheed Martin, Thales Group and Rolls Royce – they all migrated to our system after replacing IBM’s DOORS platform. Many other Fortune 500 customers are using one or the other of our products. Partial list here - https://optimizory.com/customers/. The list was zero-sized when I joined.
  - Built a team of 16 engineers starting from scratch. Mentored and successfully retained all of them in a startup environment. 
  - I conduct regular brainstorming session on the technical challenges to come up with various options and then finally selecting one. My focus is always on building a culture of innovation. Special focus on conducting seminars based on current researches going on. Sometimes this includes discussions on customer success, marketing and sales as well. 
  - Large enterprise customers have huge demand of handling millions of entities with complex relations in databases. A radically different solution solved most of those problems.
  - Did pioneering work many times in my career – first Fortran 2003 compiler for NEC’s super-computer, one of the first companies to serve audio/video media on a mobile device (at PacketVideo, while working at HCL), first digital transformation projects in government (2000-2003), Challenged IBM DOORs with a Requirement Management System that we built from scratch.

* This tree is hidden :noexport:
** Cover Letter
I'm an extremely effective software engineering leader, focusing particularly on open source technologies and agile practices. With 19+ years of hands-on industry experience, I understand how to select, build and refine software and teams to add business value and reduce costs.

People hire me to lead their software teams, solve hard technical problems, advise them on technology choices, and coach their developers using the latest industry practices and tools. Clients and employers around the world have valued my versatility and balance of deep technical, business and people skills.

I've worked as a senior consultant at elite companies such as Cadence Design Systems, NEC, and consulted independently with huge industry-leading businesses both in the India, US, Japan.  But start-ups are my real passion: I've started some, led development at several others, and consulted with yet more.

Areas of particular technical expertise and interest currently include design of manufacturing process automation, robotics, artificial intelligence, large data systems, programming languages, operating systems, and I have a high level knowledge across a very wide range of languages and open source technologies. With my fingers in many pies.

I am sure my it will challenging and interesting to work with your organization. And hence I would like to apply for this opportunity.

** Summary
Organizations can do much better if they invest in the right technology at the right time. Otherwise they just fade away. One of my permanent objectives is to continuously explore emerging technologies and keep myself hands on with it. I like to keep the systems progressively aligned with the latest technology trends. I am currently exploring new areas where I can make a meaningful impact.

Below are highlights of my career. I am looking for opportunities where I can leverage my skills and apply it for larger overall impact on the growth of an organization.

- Designed first of its kind assembly line interlocking system based on Raspberry Pi for an auto components manufacturing company in Gurgaon. They were struggling to get this done since past many years and have tried to work with many other consultants. This is first such system based on Raspberry Pi. Practically infinitely scalable, extensible. Earlier systems are mostly based on PLCs and they are difficult to integrate with databases and other record keeping systems. The data gathered can now be easily used for machine-learning and artificial intelligent systems.
- I am currently managing three product teams, each of which has significant engineering requirements. All three products are served from Amazon's AWS Cloud. One of them is having a large number of concurrent users. The other two products are for enterprise use and are available for cluster configuration within the premise of an organisation. Products can be seen at https://optimizory.com/products/.
- US Department of Defense, NASA, Lockheed Martin, Thales Group and Rolls Royce – they all migrated to our system after replacing IBM’s DOORS platform. Many other Fortune 500 customers are using one or the other of our products. Partial list here - https://optimizory.com/customers/. The list was zero-sized when I joined.
- Built a team of 16 engineers starting from scratch. Mentored and successfully retained all of them in a startup environment. 
- I conduct regular brainstorming session on the technical challenges to come up with various options and then finally selecting one. My focus is always on building a culture of innovation. Special focus on conducting seminars based on current researches going on. Sometimes this includes discussions on customer success, marketing and sales as well. 
- Large enterprise customers have huge demand of handling millions of entities with complex relations in databases. A radically different solution solved most of those problems.
- Did pioneering work many times in my career – first Fortran 2003 compiler for NEC’s super-computer, one of the first companies to serve audio/video media on a mobile device (at PacketVideo, while working at HCL), first digital transformation projects in government (2000-2003), Challenged IBM DOORs with a Requirement Management System that we built from scratch.

Below, I am listing the skills which are relevant to the position.

* Skills
  - Solution design, tool selection, elaborate evaluation of technology
  - Industrial automation – PLC, Raspberry Pi, SCADA
  - Object Oriented and Functional Programming
  - Machine Learning / Deep Learning specialization (certification from Coursera/Stanford University)
  - Agile Management Methodologies (Scrum, Boards etc.)
  - Very well versed with intricacies of Assembly Manufacturing Environment and Systems like Unix, GNU/Linux, FreeBSD, macOS, AIX, Solaris and Windows
  - Source Code Management – CVS, SVN, Mercurial, Git, ClearCase
  - Scripting and Programming languages – Rust, Ruby, Perl, Python, Awk, Sed, C, C++, Java, Octave (Matlab), Jupyter, R
  - Web – HTML, CSS, JavaScript, APIs. Fameworks – VueJS, ReactJS, NodeJS, Bootstrap, Rails etc.

* Experience
** Chief Technology Officer - Optimizory Technologies
   <2014-10-01 Wed>--

   - From concept to fully developed product. I have successfully delivered three products at Optimizory - RMsis, vREST, and LXP.
   - [[https://marketplace.atlassian.com/apps/30899/rmsis-requirements-management-for-jira][RMsis]] – a requirement engineering tool, [[https://marketplace.atlassian.com/apps/1211120/links-explorer-traceability-hierarchy][LXP]] – a traceability tool, [[https://vrest.io/][vREST]] is a RESTful API testing tool.
   - Research on new possibilities like automatically extracting requirements from RFPs using Machine Learning.
   - Conceptualize, prioritize requirements, write product specifications, and drive product development through close interaction with engineering teams.
   - Careful selection of new team members and subsequent mentoring is the most important part of my work. I expose new members to the wide spectrum of technology. There are limitless possibilities. I want them to be leaders in their respective areas.
   - Discussing problems and arriving at a solution. This is real fun when you have a high performing team and are heaving a fully charged discussion. This fills me with more energy. It gives conviction to the team also.
   - Finally, reporting everything to seniors. Activities like development and testing status. Development challenges, performance and quality issues must be reported.

