docs/resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2026-03-09 Mon 21:54 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Pankaj Jangid</title>
    <meta name="generator" content="Org Mode" />
    <link rel="stylesheet" type="text/css" href="css/main.css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <nav class="site-nav"><a href="/">Home</a> | <a href="/notes/">Notes</a></nav>
    </div>
    <div id="content" class="content">
      <h1 class="title">Pankaj Jangid
	<br />
	<span class="subtitle">46 Sadar Apartments, Mayur Vihar Phase 1 Extension, New Delhi 110091, India +91-9811942047 . pankaj.jangid@codeisgreat.com <a href="https://www.linkedin.com/in/pankaj-jangid/">https://www.linkedin.com/in/pankaj-jangid/</a> . <a href="https://github.com/jangid/">https://github.com/jangid/</a></span>
      </h1>
      <hr />
      <div id="outline-container-org6a4799b" class="outline-2">
	<h2 id="org6a4799b">Skills</h2>
	<div class="outline-text-2" id="text-org6a4799b">
	  <ul class="org-ul">
	    <li>Solution design, tool selection, elaborate evaluation of technology</li>
	    <li>Industrial automation – PLC, Raspberry Pi, SCADA</li>
	    <li>Object Oriented and Functional Programming</li>
	    <li>Machine Learning / Deep Learning specialization (certification from Coursera/Stanford University)</li>
	    <li>Agile Management Methodologies (Scrum, Boards etc.)</li>
	    <li>Very well versed with intricacies of Assembly Manufacturing Environment and Systems like Unix, GNU/Linux, FreeBSD, macOS, AIX, Solaris and Windows</li>
	    <li>Source Code Management – CVS, SVN, Mercurial, Git, ClearCase</li>
	    <li>Scripting and Programming languages – Rust, Ruby, Perl, Python, Awk, Sed, C, C++, Java, Octave (Matlab), Jupyter, R</li>
	    <li>Web – HTML, CSS, JavaScript, APIs. Fameworks – VueJS, ReactJS, NodeJS, Bootstrap, Rails etc.</li>
	  </ul>
	</div>
      </div>
      <div id="outline-container-orgb1e2f21" class="outline-2">
	<h2 id="orgb1e2f21">Experience</h2>
	<div class="outline-text-2" id="text-orgb1e2f21">
	</div>
	<div id="outline-container-orgcfb3d87" class="outline-3">
	  <h3 id="orgcfb3d87">Chief Technology Officer - Optimizory Technologies</h3>
	  <div class="outline-text-3" id="text-orgcfb3d87">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-01 Wed&gt;</span></span>&#x2013;
	    </p>

	    <ul class="org-ul">
	      <li>From concept to fully developed product. I have successfully delivered three products at Optimizory - RMsis, vREST, and LXP.</li>
	      <li><a href="https://marketplace.atlassian.com/apps/30899/rmsis-requirements-management-for-jira">RMsis</a> – a requirement engineering tool, <a href="https://marketplace.atlassian.com/apps/1211120/links-explorer-traceability-hierarchy">LXP</a> – a traceability tool, <a href="https://vrest.io/">vREST</a> is a RESTful API testing tool.</li>
	      <li>Research on new possibilities like automatically extracting requirements from RFPs using Machine Learning.</li>
	      <li>Conceptualize, prioritize requirements, write product specifications, and drive product development through close interaction with engineering teams.</li>
	      <li>Careful selection of new team members and subsequent mentoring is the most important part of my work. I expose new members to the wide spectrum of technology. There are limitless possibilities. I want them to be leaders in their respective areas.</li>
	      <li>Discussing problems and arriving at a solution. This is real fun when you have a high performing team and are heaving a fully charged discussion. This fills me with more energy. It gives conviction to the team also.</li>
	      <li>Finally, reporting everything to seniors. Activities like development and testing status. Development challenges, performance and quality issues must be reported.</li>
	    </ul>
	  </div>
	</div>
