src/resume.org
** Member of Consulting Staff - Cadence Design Systems
   <2006-09-01 Fri>--<2014-09-30 Tue>

   - Cadence is industry leader in Electronic Design Automation (EDA). There are hundreds of tools with enormous amount of documentation. Literally terabytes of data. The challenge was to organize this content and make it searchable so that the users have precise information when they need it. I was given the task leading this effort.
   - I designed the Search Analyzers that we could fit into Lucene. We used C++ variant of Lucene to plugin into a tool that we named Cadence Help.
   - Cadence’s documents are scattered in FrameMaker files, Confluence, Source Code in various Programming Languages (Open and Proprietary). Search Analyzers have the intelligence to understand all these formats. This helps Lucene to index them and retrieve the appropriate document when requested.
   - Lead the initiative to support HTML5 markup in Cadence Help. This was a huge cost saving. Because most of the modern tools (Confluence) support HTML5 outputs and there was no option for older HTML outputs. And Cadence Help had many patches to translated new formats to older HTML4 version to make it work.
   - Also tried to work on standardizing content format across Cadence. Evaluated DITA specifications. Later on, the idea was dropped in favour of an advanced collaborative authoring platform Confluence.
   - Lead the development and later maintenance of Cadence Help and complete content infrastructure of Cadence till the time I left Cadence. Cadence Help is still shipped as part of all the Cadence Tools and the content infrastructure that I designed and developed is still in use at Cadence.

** Technical Lead, HCL Technologies
   <2004-01-01 Thu>--<2006-08-31 Thu>

   - Compiler design: Designed and proposed a new strategy for Fortran 2003 compiler front-end. Fortran is a nightmare for compiler designers. There are no reserved keywords, spaces change the meaning. I studied theoretical computer science, explored research papers, read books, including the dragon book by Aho, Ulman and Sethi. Then I came up with a solution which was well appreciated and rewarded by the customer.
   - Media Streaming: I worked for PacketVideo on a media streaming system. This system was based on real media protocol which has two channels – (1) Data (2) Control. I prototyped a system where a user sends control signals using the user-interface for example play, pause, skip etc. and server optimizes bandwidth by responding to these control signals. It stops when pause is received, starts when play received, and so on. 
   - Data Caching: I was part of the team that developed EdgeXtend, a database caching and distribution solution. In this setup an application always interacts with nearest in-memory cache node. EdgeXtend takes care of syncing the cache with the backend and other nodes.

** Senior System Analyst, SPG Solution
   <2003-03-01 Sat>--<2003-12-31 Wed>

   - Recruitlive: End-to-end HR solution. It was written in Visual Java on the Microsoft platform. And asynchronous VB script was extensively used in it. This was much before the async of JavaScript was implemented.

** Software Engineer, National Centre for Software Technologies (now C-DAC)
   <2000-08-01 Tue>--<2003-02-28 Fri>

   - Published a research paper “Sandesh: An Automated Email Responding System” and implemented this system using Java programming language. This was an information retrieval system based on statistical analysis of large amount of email data. A query received would be automatically replied by parsing the queries and scanning through the index of earlier human responses. (https://www.researchgate.net/publication/2875837_Sandesh_Response_Management_System) 
   - NCST is best place for self-motivated people. Complete freehand to choose technology and implement a solution for a given problem. As freshers, we were allowed to make technology choices.
   - I worked on various web projects. I started with CGI. Later developed applications using JSP/Java and Perl also.
   - In my free time, I worked on several hobby projects – (1) Implemented virtual memory (VM) for NachOS educational operating system (2) Created an 8085 microprocessor emulator using C and ncurses library. I used ncurses library to visually show the data inside the registers of the microprocessor. (https://cvs.savannah.nongnu.org/viewvc/vm/vm8085++/)
   - Simultaneously I had completed advanced courses on Artificial Intelligence, Machine Learning and Natural Language Processing.

* Certifications
** Deep Learning Specialization, Standford University, Coursera
   <2019-03-09 Sat> - [[https://www.coursera.org/account/accomplishments/specialization/72ZS89ZWPERF?utm_medium=certificate&utm_source=link&utm_campaign=copybutton_certificate][See credential]]

** Machine Learning, Stanford University, Coursera
   <2019-02-08 Fri> - [[https://www.coursera.org/account/accomplishments/verify/2RM447BFPKDW?utm_medium=certificate&utm_source=link&utm_campaign=copybutton_certificate][See credential]]

* Education
** MS Software Systems, BITS Pilani
   <2007-12-31 Mon>

   - This is a distance learning program for working professionals. After looking at the syllabus of the program, I got interested into it. Subjects were – Advanced Operating Systems, Data warehousing, Data Analytics, Embedded Systems, Software Engineering, Advanced Networking and Telecommunications.
   - My project was Content Management System with DITA Support. I completed this project while I was working at Cadence Design Systems. DITA was one of the standards that we were contemplating to use in Cadence, so I took this up as my desertion. This helped us in evaluating DITA.

** BE Electrical, CTAE Udaipur
   <2000-06-30 Fri>

   - This under-grad course mainly consisted of subjects pertaining to electrical engineering. Computer Programming and Microprocessors were the two subjects that kicked of my interest in the field of Computer Science. I wrote several graphics libraries in Borland C. Later I used them in creating basic computer games like Tetris.
   - Team sports interests me a lot. I got selected for the college volleyball team and our team was ranked 2nd in the university.
   - In my 3rd year, I took part in the elections. And I could convince my fellow students to vote for me. As a result, I was elected General Secretary of the college student union.

