docs/resume.html
	<div id="outline-container-org8c0d0f2" class="outline-3">
	  <h3 id="org8c0d0f2">Member of Consulting Staff - Cadence Design Systems</h3>
	  <div class="outline-text-3" id="text-org8c0d0f2">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2006-09-01 Fri&gt;&#x2013;&lt;2014-09-30 Tue&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>Cadence is industry leader in Electronic Design Automation (EDA). There are hundreds of tools with enormous amount of documentation. Literally terabytes of data. The challenge was to organize this content and make it searchable so that the users have precise information when they need it. I was given the task leading this effort.</li>
	      <li>I designed the Search Analyzers that we could fit into Lucene. We used C++ variant of Lucene to plugin into a tool that we named Cadence Help.</li>
	      <li>Cadence’s documents are scattered in FrameMaker files, Confluence, Source Code in various Programming Languages (Open and Proprietary). Search Analyzers have the intelligence to understand all these formats. This helps Lucene to index them and retrieve the appropriate document when requested.</li>
	      <li>Lead the initiative to support HTML5 markup in Cadence Help. This was a huge cost saving. Because most of the modern tools (Confluence) support HTML5 outputs and there was no option for older HTML outputs. And Cadence Help had many patches to translated new formats to older HTML4 version to make it work.</li>
	      <li>Also tried to work on standardizing content format across Cadence. Evaluated DITA specifications. Later on, the idea was dropped in favour of an advanced collaborative authoring platform Confluence.</li>
	      <li>Lead the development and later maintenance of Cadence Help and complete content infrastructure of Cadence till the time I left Cadence. Cadence Help is still shipped as part of all the Cadence Tools and the content infrastructure that I designed and developed is still in use at Cadence.</li>
	    </ul>
	  </div>
	</div>
	<div id="outline-container-org4b36145" class="outline-3">
	  <h3 id="org4b36145">Technical Lead, HCL Technologies</h3>
	  <div class="outline-text-3" id="text-org4b36145">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2004-01-01 Thu&gt;&#x2013;&lt;2006-08-31 Thu&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>Compiler design: Designed and proposed a new strategy for Fortran 2003 compiler front-end. Fortran is a nightmare for compiler designers. There are no reserved keywords, spaces change the meaning. I studied theoretical computer science, explored research papers, read books, including the dragon book by Aho, Ulman and Sethi. Then I came up with a solution which was well appreciated and rewarded by the customer.</li>
	      <li>Media Streaming: I worked for PacketVideo on a media streaming system. This system was based on real media protocol which has two channels – (1) Data (2) Control. I prototyped a system where a user sends control signals using the user-interface for example play, pause, skip etc. and server optimizes bandwidth by responding to these control signals. It stops when pause is received, starts when play received, and so on.</li>
	      <li>Data Caching: I was part of the team that developed EdgeXtend, a database caching and distribution solution. In this setup an application always interacts with nearest in-memory cache node. EdgeXtend takes care of syncing the cache with the backend and other nodes.</li>
	    </ul>
	  </div>
	</div>
	<div id="outline-container-orga096403" class="outline-3">
	  <h3 id="orga096403">Senior System Analyst, SPG Solution</h3>
	  <div class="outline-text-3" id="text-orga096403">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2003-03-01 Sat&gt;&#x2013;&lt;2003-12-31 Wed&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>Recruitlive: End-to-end HR solution. It was written in Visual Java on the Microsoft platform. And asynchronous VB script was extensively used in it. This was much before the async of JavaScript was implemented.</li>
	    </ul>
	  </div>
	</div>
	<div id="outline-container-org683d1d5" class="outline-3">
	  <h3 id="org683d1d5">Software Engineer, National Centre for Software Technologies (now C-DAC)</h3>
	  <div class="outline-text-3" id="text-org683d1d5">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2000-08-01 Tue&gt;&#x2013;&lt;2003-02-28 Fri&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>Published a research paper “Sandesh: An Automated Email Responding System” and implemented this system using Java programming language. This was an information retrieval system based on statistical analysis of large amount of email data. A query received would be automatically replied by parsing the queries and scanning through the index of earlier human responses. (<a href="https://www.researchgate.net/publication/2875837_Sandesh_Response_Management_System">https://www.researchgate.net/publication/2875837_Sandesh_Response_Management_System</a>)</li>
	      <li>NCST is best place for self-motivated people. Complete freehand to choose technology and implement a solution for a given problem. As freshers, we were allowed to make technology choices.</li>
	      <li>I worked on various web projects. I started with CGI. Later developed applications using JSP/Java and Perl also.</li>
	      <li>In my free time, I worked on several hobby projects – (1) Implemented virtual memory (VM) for NachOS educational operating system (2) Created an 8085 microprocessor emulator using C and ncurses library. I used ncurses library to visually show the data inside the registers of the microprocessor. (<a href="https://cvs.savannah.nongnu.org/viewvc/vm/vm8085++/">https://cvs.savannah.nongnu.org/viewvc/vm/vm8085++/</a>)</li>
	      <li>Simultaneously I had completed advanced courses on Artificial Intelligence, Machine Learning and Natural Language Processing.</li>
	    </ul>
	  </div>
	</div>
      </div>
      <div id="outline-container-orgfc16ba6" class="outline-2">
	<h2 id="orgfc16ba6">Certifications</h2>
	<div class="outline-text-2" id="text-orgfc16ba6">
	</div>
	<div id="outline-container-org9c765b5" class="outline-3">
	  <h3 id="org9c765b5">Deep Learning Specialization, Standford University, Coursera</h3>
	  <div class="outline-text-3" id="text-org9c765b5">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-03-09 Sat&gt; </span></span> - <a href="https://www.coursera.org/account/accomplishments/specialization/72ZS89ZWPERF?utm_medium=certificate&amp;utm_source=link&amp;utm_campaign=copybutton_certificate">See credential</a>
	    </p>
	  </div>
	</div>
	<div id="outline-container-orga67fedd" class="outline-3">
	  <h3 id="orga67fedd">Machine Learning, Stanford University, Coursera</h3>
	  <div class="outline-text-3" id="text-orga67fedd">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-02-08 Fri&gt; </span></span> - <a href="https://www.coursera.org/account/accomplishments/verify/2RM447BFPKDW?utm_medium=certificate&amp;utm_source=link&amp;utm_campaign=copybutton_certificate">See credential</a>
	    </p>
	  </div>
	</div>
      </div>
      <div id="outline-container-orgeada39c" class="outline-2">
	<h2 id="orgeada39c">Education</h2>
	<div class="outline-text-2" id="text-orgeada39c">
	</div>
	<div id="outline-container-orgdc6159f" class="outline-3">
	  <h3 id="orgdc6159f">MS Software Systems, BITS Pilani</h3>
	  <div class="outline-text-3" id="text-orgdc6159f">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2007-12-31 Mon&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>This is a distance learning program for working professionals. After looking at the syllabus of the program, I got interested into it. Subjects were – Advanced Operating Systems, Data warehousing, Data Analytics, Embedded Systems, Software Engineering, Advanced Networking and Telecommunications.</li>
	      <li>My project was Content Management System with DITA Support. I completed this project while I was working at Cadence Design Systems. DITA was one of the standards that we were contemplating to use in Cadence, so I took this up as my desertion. This helped us in evaluating DITA.</li>
	    </ul>
	  </div>
	</div>
	<div id="outline-container-org5686617" class="outline-3">
	  <h3 id="org5686617">BE Electrical, CTAE Udaipur</h3>
	  <div class="outline-text-3" id="text-org5686617">
	    <p>
	      <span class="timestamp-wrapper"><span class="timestamp">&lt;2000-06-30 Fri&gt;</span></span>
	    </p>

	    <ul class="org-ul">
	      <li>This under-grad course mainly consisted of subjects pertaining to electrical engineering. Computer Programming and Microprocessors were the two subjects that kicked of my interest in the field of Computer Science. I wrote several graphics libraries in Borland C. Later I used them in creating basic computer games like Tetris.</li>
	      <li>Team sports interests me a lot. I got selected for the college volleyball team and our team was ranked 2nd in the university.</li>
	      <li>In my 3rd year, I took part in the elections. And I could convince my fellow students to vote for me. As a result, I was elected General Secretary of the college student union.</li>
	    </ul>
	  </div>
	</div>
      </div>
