src/resume.org
* Activities
  I volunteer my time for two foundations (trusts):

  1. Incredible Bharat Foundation is committed to promotion of Indian culture, literature, arts through exhibitions, conferences and ground events
  2. Seema Jagran Manch works in the border areas to raise awareness about border and national security. We collaborate with Government bodies and citizens to make this happen. We also publish a magazine by the name Seema Sanghosh. I am chief editor for the magazine.
