docs/resume.html
      <div id="outline-container-orgad3cde4" class="outline-2">
	<h2 id="orgad3cde4">Activities</h2>
	<div class="outline-text-2" id="text-orgad3cde4">
	  <p>
	    I volunteer my time for two foundations (trusts):
	  </p>

	  <ol class="org-ol">
	    <li>Incredible Bharat Foundation is committed to promotion of Indian culture, literature, arts through exhibitions, conferences and ground events</li>
	    <li>Seema Jagran Manch works in the border areas to raise awareness about border and national security. We collaborate with Government bodies and citizens to make this happen. We also publish a magazine by the name Seema Sanghosh. I am chief editor for the magazine.</li>
	  </ol>
	</div>
      </div>
    </div>
  </body>
</html>
